# DATA CLEANING AND PREPARATION

In [ ]:
## loading the data first ... 
df = pd.read_csv('created.csv')
print(df.columns)
print(df)

Index(['0', 'Zero', 'One', 'Two', 'Three'], dtype='object')
   0  Zero  One  Two  Three
0  0     0    1    2      3
1  1     4    5    6      7
2  2     8    9   10     11

In [ ]:
float_data = pd.Series([1.2,-3.5,np.nan, 0]);
float_data.isna().sum()

np.int64(1)

In [ ]:
data=pd.DataFrame([[1.,6.5,3.],[1.,np.nan,np.nan],
                  [np.nan,np.nan,np.nan],[np.nan,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

#### Dropping the Cols

In [ ]:
# here is any particular row,col is NaN then in that case whole row is dropped !
data.dropna()

# here if only whole row is NaN in that case only the whole row is dropped !
data.dropna(how="all")

# dropping the col's instead of rows && how="all" specifies that if the while col is Nan in that case only we drop
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0  0.698617       NaN       NaN
1  0.299929       NaN       NaN
2  0.882003       NaN  0.780388
3 -0.296464       NaN  0.025227
4  0.569345 -0.178700 -0.393506
5 -0.449529 -1.341606 -1.744743
6 -1.947398  0.322508  0.255398

In [ ]:
# droping rows / cols only if below a specific threshold 

# thres specifies how many minimum non NaN rows are needed .. like suppose thresh is like 3 then that all the rows having more less than 3 non NaN are droped 
df.dropna(thresh=2)

# here axis = 1 specifies that rather than looking and deleting for rows .. we look for cols and delete them 
df.dropna(thresh=4, axis=1)

          0         2
0  0.698617       NaN
1  0.299929       NaN
2  0.882003  0.780388
3 -0.296464  0.025227
4  0.569345 -0.393506
5 -0.449529 -1.744743
6 -1.947398  0.255398

### Flling with Missing Values

In [ ]:
df

          0         1         2
0  0.698617       NaN       NaN
1  0.299929       NaN       NaN
2  0.882003       NaN  0.780388
3 -0.296464       NaN  0.025227
4  0.569345 -0.178700 -0.393506
5 -0.449529 -1.341606 -1.744743
6 -1.947398  0.322508  0.255398

In [ ]:
df.fillna(0)

          0         1         2
0  0.698617  0.000000  0.000000
1  0.299929  0.000000  0.000000
2  0.882003  0.000000  0.780388
3 -0.296464  0.000000  0.025227
4  0.569345 -0.178700 -0.393506
5 -0.449529 -1.341606 -1.744743
6 -1.947398  0.322508  0.255398

In [ ]:
# here we specify that we want to fill the col 1 with 0.5 and col 2 as 0.9 if there is NaN
df.fillna({1:0.5, 2:0.9})

          0         1         2
0  0.698617  0.500000  0.900000
1  0.299929  0.500000  0.900000
2  0.882003  0.500000  0.780388
3 -0.296464  0.500000  0.025227
4  0.569345 -0.178700 -0.393506
5 -0.449529 -1.341606 -1.744743
6 -1.947398  0.322508  0.255398

##### ffill -> Forward Fill if a technique we use to fill the missing values and put the values of the previous row of that particular column in the current missing box .. so the problem here is .. suppose the first box is only NaN then in that case it is kept NaN only and not changed becz no previous values to forward fill it.

In [ ]:
# here we are trying to forward fill it the missing values using forward fill (ffill) but since there is no numbers before the NaN hence forward fill fails 
df.ffill()

          0         1         2
0  0.698617       NaN       NaN
1  0.299929       NaN       NaN
2  0.882003       NaN  0.780388
3 -0.296464       NaN  0.025227
4  0.569345 -0.178700 -0.393506
5 -0.449529 -1.341606 -1.744743
6 -1.947398  0.322508  0.255398

In [ ]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[3:, 2] = np.nan
df.iloc[4:, 0:2] = np.nan
print(df)
df.ffill()

          0         1         2
0 -0.644748  0.786536  1.045882
1 -1.356468  0.746164  0.580289
2 -0.553745  0.364244 -1.110547
3  1.394042 -1.049290       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN
6       NaN       NaN       NaN

          0         1         2
0 -0.644748  0.786536  1.045882
1 -1.356468  0.746164  0.580289
2 -0.553745  0.364244 -1.110547
3  1.394042 -1.049290 -1.110547
4  1.394042 -1.049290 -1.110547
5  1.394042 -1.049290 -1.110547
6  1.394042 -1.049290 -1.110547

In [ ]:
# repeat only twice the same value
df.ffill(limit=2)

          0         1         2
0 -0.644748  0.786536  1.045882
1 -1.356468  0.746164  0.580289
2 -0.553745  0.364244 -1.110547
3  1.394042 -1.049290 -1.110547
4  1.394042 -1.049290 -1.110547
5  1.394042 -1.049290       NaN
6       NaN       NaN       NaN

In [ ]:
data= pd.DataFrame({"k1":["one","two"]*3+["two"],
                   "k2":[1,1,2,3,3,4,4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [ ]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [ ]:
new_data = data.drop_duplicates(subset=['k1'])
print(new_data)
data

    k1  k2  v1
0  one   1   0
1  two   1   1

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6